inOut/convection/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                   |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version 2.0;
	format  ascii;
	object  p;
	class   dictionary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
	inlet
	{
		type  fixedValue;
		value uniform 0.06;
	}
	outlet
	{
		type  fixedValue;
		value uniform 0.05;
	}
	bottom
	{
		type symmetryPlane;
	}
	top
	{
		type zeroGradient;
	}
	front_and_back
	{
		type empty;
	}
}

// ************************************************************************* //
