inOut/convection/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       4875;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       4900;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       4925;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       5025;
    }
    front_and_back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          5000;
        startFace       5125;
    }
)

// ************************************************************************* //
