inOut/convection/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                   |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version 2.0;
	format  ascii;
	object  blockMeshDict;
	class   dictionary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
vertices
(
	(0.0 5.0 0.0)
	(20.0 5.0 0.0)
	(0.0 10.0 0.0)
	(20.0 10.0 0.0)
	(0.0 5.0 10.0)
	(20.0 5.0 10.0)
	(0.0 10.0 10.0)
	(20.0 10.0 10.0)
);
blocks
(
	hex
	(0 1 3 2 4 5 7 6)
	(100 25 1)
	simpleGrading
	(1 1 1)
);
edges
(
);
boundary
(
	inlet
	{
		type  patch;
		faces
		(
			(0 4 6 2)
		);
	}
	outlet
	{
		type  patch;
		faces
		(
			(1 3 7 5)
		);
	}
	bottom
	{
		type  symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	top
	{
		type  patch;
		faces
		(
			(2 6 7 3)
		);
	}
	front_and_back
	{
		type  empty;
		faces
		(
			(4 5 7 6)
			(0 2 3 1)
		);
	}
);
mergePatchPairs
(
);

// ************************************************************************* //
