inOut/convection/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                   |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version 2.0;
	format  ascii;
	object  controlDict;
	class   dictionary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       icoFoam;
startFrom         latestTime;
startTime         0;
stopAt            endTime;
endTime           7.0;
deltaT            0.25;
writeControl      timeStep;
writeInterval     1;
purgeWrite        0;
writeFormat       ascii;
writePrecision    6;
writeCompression  off;
timeFormat        general;
timePrecision     6;
runTimeModifiable true;

// ************************************************************************* //
